Revit 2027 API
GenericImportOptions Class
Generic Import options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GenericImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class GenericImportOptions
Public MustInherit Class GenericImportOptions
public ref class GenericImportOptions abstract
[<AbstractClassAttribute>]
type GenericImportOptions = class end
The GenericImportOptions type exposes the following members.
Properties
Name | Description
RefPoint | Reference point (in Revit) to which the image is going to be inserted.
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace